const typeText = [
    {
        "id": "1",
        "name": "可回收物",
        "color": "#2d8cf0",
        "explain": "废纸张、废塑料、废玻璃制品、废金属、废织物等适宜回收、可循环利用的生活废弃物",
        "require": "轻投轻放；清洁干燥，避免污染；废纸尽量平整；立体包装物请清空内容物，清洁后压扁投放；有尖锐边角的，应包裹后投放",
        "image":"../../resources/images/tcimg01.png"
    },
    {
        "id": "2",
        "name": "有害垃圾",
        "color": "#ed3f14",
        "explain": "对人体健康或自然环境造成直接或潜在的危害废弃物。",
        "require": "充电电池、纽扣电池、蓄电池投放时应注意轻放；油漆桶、杀虫剂如有残留请密闭后投放；荧光灯、节能灯易破损连带包装或包裹后投放；废药品及其包装一并投放",
        "image":"../../resources/images/tcimg02.png"
    },
    {
        "id": "3",
        "name": "湿垃圾",
        "color": "#664035",
        "explain": "部分地区又称”厨余垃圾”，日常生活垃圾产生的容易腐烂的生物质废物。",
        "require": "餐厨垃圾应沥干水分后再投放，有包装物的应取出后分类投放；大块骨头和椰子壳，榴莲壳等不易生化降解，作为干垃圾进行投放；纯液体（如牛奶等），可直接倒入下水口",
        "image":"../../resources/images/tcimg03.png"
    },
    {
        "id": "4",
        "name": "干垃圾",
        "color": "#495060",
        "explain": "部分地区又称”其他垃圾”，除有害垃圾、可回收物、湿垃圾以外的生活废弃物。",
        "require": "尽量沥干水分；难以辨别的生活垃圾应投入干垃圾容器内",
        "image":"../../resources/images/tcimg04.png"
    },
    {
        "id": "5",
        "name": "宠物粪便",
        "color": "#2d8cf0",
        "explain": "此类物品可能携带细菌病毒寄生虫，不建议进入生活垃圾处理渠道，尽量将其归入城市粪便处理系统；",
        "require": "实在不便归入粪便处理系统时，可包裹后投入干垃圾桶内。",
        "image":""
    },
    {
        "id": "6",
        "name": "大件垃圾",
        "color": "#2d8cf0",
        "explain": "可以预约可回收物经营者或者大件垃圾收集运输单位上门回收，或者投放至管理责任人指定的场所。",
        "require": "",
        "image":""
    },
    {
        "id": "7",
        "name": "家用医疗用",
        "color": "#2d8cf0",
        "explain": "建议投放到医院，社区医院或者设有医废回收的药店；无法进行上述投放时，可以投放到干垃圾。",
        "require": "",
        "image":""
    },
    {
        "id": "8",
        "name": "小型电器电子产品",
        "color": "#2d8cf0",
        "explain": "可按照可回收物的投放方式进行投放。",
        "require": "",
        "image":""
    },
    {
        "id": "9",
        "name": "装修垃圾",
        "color": "#2d8cf0",
        "explain": "袋装后投放到指定的装修垃圾堆放场所；应与生活垃圾分开收集。",
        "require": "",
        "image":""
    }
]

module.exports = {
    typeText: typeText
}